app/Http/Controllers/CrudController.php

select count(*) as aggregate from `products`
---
    public function index()
    {
        $productos = Product::paginate(10);

insert into `products` (`name`, `description`, `price`, `category`, `image`, `updated_at`, `created_at`) values ('Kit 5 Piezas Mochila Moda Coreana Kawaii con Pin y Accesorios Verde', 'Kit 5 Piezas Mochila Moda Coreana Kawaii con Pin y Accesorios Verde', '599', 'Mochilas', '{}', '2022-05-13 22:56:07', '2022-05-13 22:56:07')
update `products` set `image` = '/storage/img/product/J0EnLPtcYMaloSwnh8BGuYikRUUwLMEzHTPZnE61.jpg', `products`.`updated_at` = '2022-05-13 22:56:07' where `id` = 1
---
    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required',
            'description' => 'required',
            'price' => 'required',
            'category' => 'required',
            'image' => 'required|image',
        ]);
        $imagenes = $request->image->store('public/img/product');
        $url = Storage::url($imagenes);
        $producto = Product::create($request->all());
        $producto->image = $url;
        $producto->save();