app/Http/Controllers/LandingPageController.php

select distinct `category` from `products`
select * from `products` limit 15 offset 0
select count(*) as aggregate from `products`
---
    public function index()
    {
        $categories = Product::select('category')->distinct()->get();
        $products = Product::paginate();