app/Http/Controllers/ShopController.php

select distinct `category` from `products`
select * from `products` limit 12 offset 0
select count(*) as aggregate from `products`
select count(*) as aggregate from `products` where `category` = 'Mochilas'
---
    public function index()
    {
        $categories = Product::select('category')->distinct()->get();
        $products = Product::paginate(12);

        $arr_count = array();
        foreach($categories as $category){
            $count = Product::where('category', $category->category)->count();